from tkinter import *
import random

# 전역변수
#----------------------------------------------------------------------------------------
count = 0
wSIZE = 1000
radius = 400
colors = ['red', 'green', 'blue', 'black', 'orange', 'indigo', 'violet']
#----------------------------------------------------------------------------------------

# 기본원 그리기
#----------------------------------------------------------------------------------------
# 윈도우창을 다 덮음 -> 그림을 그림 (canvas 밖으로는 그림을 못그림)
root = Tk()
canvas = Canvas(root, height=1000, width=1000, bg='white')
canvas.pack()

cx = 1000//2
cy = 1000//2
r = 400
canvas.create_oval(cx-r, cy-r, cx+r, cy+r, width=2, outline='red')

root.mainloop()
#----------------------------------------------------------------------------------------


# 2. 프렉탈 원그리기 재귀함수 선언
#----------------------------------------------------------------------------------------
def drawCircle(x, y, r):
    global count

    count += 1
    canvas.create_oval(x-r, y-r, x+r, y+r)
    canvas.create_text(x, y-r, text=str(count), font=('', 30))
    if r >= radius/2: # 아직 매개변수로 받는 반지름이 기본사이즈보다 크면
        drawCircle(x-r//2, y, r//2) # 중심의 왼쪽을 계속 그려감(재귀호출)
        drawCircle(x+r//2, y, r//2) # 중심의 오른쪽을 계속 그려감(재귀호출)
#----------------------------------------------------------------------------------------

# 프렉탈 원그리기 메인모듈
#----------------------------------------------------------------------------------------
root = Tk()
canvas = Canvas(root, height=wSIZE, width=wSIZE, bg='white')

drawCircle(wSIZE//2, wSIZE//2, radius)
canvas.pack()
root.mainloop()
#----------------------------------------------------------------------------------------


# 원도형의 전체 프랙탈 그리기
#----------------------------------------------------------------------------------------

# 프렉탈 원그리기 재귀함수 선언
#----------------------------------------------------------------------------------------
def drawCircle(x, y, r):
    canvas.create_oval(x-r, y-r, x+r, y+r, width = 2, outline=random.choice(colors))
    if r >= 5:
        drawCircle(x+r//2, y, r//2)
        drawCircle(x-r//2, y, r//2)
#----------------------------------------------------------------------------------------

# 메인 모듈
#----------------------------------------------------------------------------------------
root = Tk()
root.title('원 모양의 프랙탈')
canvas = Canvas(root, height=wSIZE, width=wSIZE, bg='white')

drawCircle(wSIZE//2, wSIZE//2, radius)
canvas.pack()
root.mainloop()
#----------------------------------------------------------------------------------------