import random

# TreeNode 클래스 선언
# ----------------------------------------------------------------------------------------
class TreeNode:
    def __init__(self):
        self.left = None
        self.data = None
        self.right = None
# ----------------------------------------------------------------------------------------

# 전역 변수 선언
# ----------------------------------------------------------------------------------------
memory = []
root = None
dataAry = [ '콘말차', '삿포로 맥주', '아카페라 벤티 헤이즐넛', '레어치즈푸딩', 
           '척오리지널 메가 사워', '요아정 요거트컵', '페퍼로니피자주먹밥', 
           '널담 슈톨렌', '딸기마시멜로케이크', '버니공쥬 딸기뚱카롱', 
           '고추잡채호빵', '체다 슈크림붕어스낵']

# ----------------------------------------------------------------------------------------

# 새로 추가된 input부분
# ----------------------------------------------------------------------------------------
print('끝내고 결과를 확인하기 -> e입력')

sellAry = []

while True:
    i = input('판매된 물건을 입력하세요: ') # 입력
    print() # 한 줄 띄우기
    
    if i.lower() == 'e': # e를 소문자로 바꿔주면서 입력시 브레이크
        break
    
    if i in dataAry: # 입력값이 dataAry에 있으면 저장
        sellAry.append(i)
    else:
        print("입력된 물건이 목록에 없습니다. 다시 입력해 주세요.")

print('오늘 판매된 물건(중복O) --> \n', sellAry)
# ----------------------------------------------------------------------------------------

# 메인코드
# ----------------------------------------------------------------------------------------
# 트리의 첫 번째 노드생성, sellAry의 첫 번째 값을 할당
node = TreeNode()
node.data = sellAry[0]
root = node  # 첫 번째 노드는 트리의 루트
memory.append(node)  # 루트 노드를 메모리 리스트에 추가

# 중복판매된 물품으로 이진탐색트리 생성
for name in sellAry[1:]:
    node = TreeNode() # 새노드 생성
    node.data = name # 노드데이터에 이름쓰기

    current = root
    while True:
        if name == current.data: # 이미 가지고 있는거 제거? 그냥 넘어가기
            break
        if name < current.data: 
            if current.left == None:
                current.left = node
                memory.append(node) # 만약 처음으로 입력된값이 있으면 메모리에 추가
                break
            current = current.left
        else:
            if current.right == None:
                current.right = node
                memory.append(node) # 만약 처음으로 입력된값이 있으면 메모리에 추가
                break
            current = current.right
# ----------------------------------------------------------------------------------------

# 중복 없이 출력하는 함수
# ----------------------------------------------------------------------------------------
def preorder(node): # 이진탐색트리 전위순회
    if node == None:
        return
    print(node.data, end=' ')
    preorder(node.left)
    preorder(node.right)

print('오늘 판매된 종류(중복X) --> ', end=' ')
preorder(root)
# ----------------------------------------------------------------------------------------